import React from 'react';
import { objectToCssVariables } from '@/theme/util';

export const THEME_COLOR = {
  gray: {
    '50': '#f9fafb',
    '100': '#f3f4f6',
    '200': '#e5e7eb',
    '300': '#d1d5db',
    '400': '#9ca3af',
    '500': '#6b7280',
    '600': '#4b5563',
    '700': '#374151',
    '800': '#1f2937',
    '900': '#111827',
    '950': '#030712',
  },
  blue: {
    '50': '#ecfaff',
    '100': '#d4f1ff',
    '200': '#b2e9ff',
    '300': '#7dddff',
    '400': '#40c7ff',
    '500': '#14a7ff',
    '600': '#0086ff',
    '700': '#006eff',
    '800': '#005bd4',
    '900': '#084da0',
    '950': '#0a2f61',
  },
  yellow: {
    '50': '#fefce8',
    '100': '#fef9c3',
    '200': '#fef08a',
    '300': '#fde047',
    '400': '#facc15',
    '500': '#eab308',
    '600': '#ca8a04',
    '700': '#a16207',
    '800': '#854d0e',
    '900': '#713f12',
    '950': '#422006',
  },
  red: {
    '50': '#fef2f2',
    '100': '#fee2e2',
    '200': '#fecaca',
    '300': '#fca5a5',
    '400': '#f87171',
    '500': '#ef4444',
    '600': '#dc2626',
    '700': '#b91c1c',
    '800': '#991b1b',
    '900': '#7f1d1d',
    '950': '#450a0a',
  },
  green: {
    '50': '#f2f9ec',
    '100': '#e1f1d6',
    '200': '#b9df9f',
    '300': '#a2d383',
    '400': '#81c05b',
    '500': '#63a43e',
    '600': '#4a822e',
    '700': '#3b6427',
    '800': '#325123',
    '900': '#2c4522',
    '950': '#14250e',
  },
  blackAlpha: {
    '50': '#0000000D', // 5% 불투명 (알파 0.05 → 0D)
    '100': '#0000001A', // 10% 불투명 (알파 0.10 → 1A)
    '200': '#00000033', // 20% 불투명 (알파 0.20 → 33)
    '300': '#0000004D', // 30% 불투명 (알파 0.30 → 4D)
    '400': '#00000066', // 40% 불투명 (알파 0.40 → 66)
    '500': '#00000080', // 50% 불투명 (알파 0.50 → 80)
    '600': '#00000099', // 60% 불투명 (알파 0.60 → 99)
    '700': '#000000B3', // 70% 불투명 (알파 0.70 → B3)
    '800': '#000000CC', // 80% 불투명 (알파 0.80 → CC)
    '900': '#000000E6', // 90% 불투명 (알파 0.90 → E6)
    '950': '#000000F2', // 95% 불투명 (알파 0.95 → F2)
    '1000': '#000000FF', // 100% 불투명 (알파 1.00 → FF)
  },
  whiteAlpha: {
    '50': '#FFFFFF0D', // 5% 불투명 (알파 0.05 → 0D)
    '100': '#FFFFFF1A', // 10% 불투명 (알파 0.10 → 1A)
    '200': '#FFFFFF33', // 20% 불투명 (알파 0.20 → 33)
    '300': '#FFFFFF4D', // 30% 불투명 (알파 0.30 → 4D)
    '400': '#FFFFFF66', // 40% 불투명 (알파 0.40 → 66)
    '500': '#FFFFFF80', // 50% 불투명 (알파 0.50 → 80)
    '600': '#FFFFFF99', // 60% 불투명 (알파 0.60 → 99)
    '700': '#FFFFFFB3', // 70% 불투명 (알파 0.70 → B3)
    '800': '#FFFFFFCC', // 80% 불투명 (알파 0.80 → CC)
    '900': '#FFFFFFE6', // 90% 불투명 (알파 0.90 → E6)
    '950': '#FFFFFFF2', // 95% 불투명 (알파 0.95 → F2)
    '1000': '#FFFFFFFF', // 100% 불투명 (알파 1.00 → FF)
  },
} as const;

type Path<T, Prefix extends string = ''> = {
  [K in keyof T]: T[K] extends object ? Path<T[K], `${Prefix}${K & string}.`> : `${Prefix}${K & string}`;
}[keyof T];

/**
 * THEME_COLOR 의 경로를 나타내는 문자열
 * 컴포넌트에서 prop 으로 전달받아 사용하기 위함
 */
export type ThemeColorPath = Path<typeof THEME_COLOR>;

/**
 * THEME_COLOR 를 css variables 로 변환
 * css 파일 생성용
 */
export const cssColorVariables: React.CSSProperties = objectToCssVariables(THEME_COLOR);
